[
  {
    "name": "Hermit",
    "dialogue": {"1": "Found me you have! Hehehe... I was once a young \nadventurer like you. Many wares I have gathered \nfrom my travels over the years!",
      "2": "Say, I have just the offer for you... \n\nBring me 5 gold coins and that rusty thing you call \na sword, and I shall give you a much better weapon that \nhas never failed to keep me safe."},
    "responses": {"1": "Have you brought what I asked?",
      "2": "You've done it! Here you go!",
      "3": "Bye! I didn't want to help you anyway"}
  },
  {
    "name": "Doctor",
    "dialogue": {"1": "You must hurry to Langtoft Village to save \nyour sister!",
      "2": "The forest route lies to the North, the mountainous \nroute to the South. Please hurry!"},
    "responses": {
      "1": "Have you retrieved the potion for your \nsister?",
      "2": "Woohoo! You win Potion Quest",
      "3": "Her death will be on your hands..."
    }
  },
  {
    "name": "Sister",
    "dialogue": {
      "1": "Your sister is too weak to talk right now."},
    "responses": {
      "1": "Your sister is too weak to talk right now."
    }
  },
  {
    "name": "Potion Seller",
    "dialogue": {
      "1": "Welcome, I am the Potion Seller, and I know what it is \nyou seek... For my creations are the strongest potions \nknown to man.",
      "2": "But I warn you - nothing in life is free, and my goods and \nservices must carry a cost.",
      "3": "Bring me a shrub- er, ahem. Let me try that again. \n\nIf you possess the trinket I seek, or will part \nwith 10 gold coins, you shall have the potion you need."},
    "responses": {
      "1": "Do you want one of my potions? \n\nIt will cost the trinket.. or 10 gold coins, your choice.",
      "2": "Splendid! Take care, child. My potions will surely kill \nall but those with the utmost need.",
      "3": "Come again if you change your mind."
    }
  },
  {
    "name": "Potion Seller's Brother",
    "dialogue": {
      "1": "\"The bridge is out! The bridge is out!\" they exclaim, \nand to that I say \"Who needs bridges!?\"",
      "2": "Behold! I am the Potion Seller's brother - Notion Seller! \nAnd I am here to sell you the notion that you don't need \na bridge to cross a river!",
      "3": "That's right, for only 3 gold coins you can have the power \nof teleportation! \n\nFor I have set up invisible runes on the \nblown out bridge remnants that, when someone holding an \nattuned gemstone steps on, will teleport you safely across!"},
    "responses": {
      "1": "What do you say? \n\nDo you want to buy an attuned gemstone??",
      "2": "Perfect! Another happy customer - here you go!",
      "3": "No? Come find me when you no longer wish to attune \nyour face to the river's rapids."
    }
  }
]